denis-koshenkov/env-alert-system/src/hal/impl/nrf52840dk/hw_platform.c
static void hw_platform_init_part_11(void *user_data)
{
    SHT31VirtualInterfaces sht31_interfaces = virtual_sht31_initialize(&sht3x_inst);
    temperature_sensor = sht31_interfaces.temperature_sensor;
    humidity_sensor = sht31_interfaces.humidity_sensor;

    BMP280VirtualInterfaces bmp280_interfaces = virtual_bmp280_initialize(&bmp280_inst);
    pressure_sensor = bmp280_interfaces.pressure_sensor;

    BH1750VirtualInterfaces bh1750_interfaces = virtual_bh1750_initialize(&bh1750_inst);
    light_intensity_sensor = bh1750_interfaces.light_intensity_sensor;

    execute_hw_init_complete_cb(HW_PLATFORM_INIT_SUCCESS);
    EAS_LOG_INF("Hw platform init complete");
}

static void init_part_10_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_11, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_10(void *user_data)
{
    uint8_t rc = bmp280_set_pres_oversampling(bmp280_inst, BMP280_OVERSAMPLING_1, init_part_10_complete, NULL);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

static void init_part_9_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_10, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_9(void *user_data)
{
    uint8_t rc = bmp280_set_temp_oversampling(bmp280_inst, BMP280_OVERSAMPLING_1, init_part_9_complete, NULL);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

static void init_part_8_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_9, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_8(void *user_data)
{
    uint8_t rc = bmp280_set_spi_3_wire_interface(bmp280_inst, BMP280_SPI_3_WIRE_DIS, init_part_8_complete, NULL);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

static void init_part_7_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_8, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_7(void *user_data)
{
    uint8_t rc = bmp280_set_filter_coefficient(bmp280_inst, BMP280_FILTER_COEFF_FILTER_OFF, init_part_7_complete, NULL);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

static void init_part_6_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_7, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_6(void *user_data)
{
    uint8_t rc = bmp280_init_meas(bmp280_inst, init_part_6_complete, NULL);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

static void init_part_5_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_6, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_5(void *user_data)
{
    uint8_t *bmp280_chip_id_p = (uint8_t *)user_data;
    EAS_ASSERT(bmp280_chip_id_p);

    if (*bmp280_chip_id_p != BMP280_CHIP_ID) {
        EAS_LOG_INF("Unexpected BMP280 chip id: 0x%2X, expected 0x%2X", *bmp280_chip_id_p, BMP280_CHIP_ID);
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
        return;
    }

    uint8_t rc = bmp280_reset_with_delay(bmp280_inst, init_part_5_complete, NULL);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

static void init_part_4_complete(uint8_t rc, void *user_data)
{
    if (rc == BMP280_RESULT_CODE_OK) {
        uint8_t *bmp280_chip_id_p = (uint8_t *)user_data;
        EAS_ASSERT(bmp280_chip_id_p);
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_5, (void *)bmp280_chip_id_p);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

/**
 * @brief Hardware platform initialization part 4.
 *
 * @param user_data This parameter is only here so that the function signature complies with what can be submitted to
 * event queue as a callback. It is not used in the implementation.
 */
static void hw_platform_init_part_4(void *user_data)
{
    uint8_t rc;
    BMP280InitCfg bmp280_cfg = {
        .get_inst_buf = bmp280_driver_get_inst_buf,
        .get_inst_buf_user_data = NULL,
        .read_regs = bmp280_driver_read_regs,
        .read_regs_user_data = (void *)&spi_op_data,
        .write_reg = bmp280_driver_write_reg,
        .write_reg_user_data = (void *)&spi_op_data,
        .start_timer = bmp280_driver_start_timer,
        .start_timer_user_data = (void *)&bmp280_timer_data,
    };
    rc = bmp280_create(&bmp280_inst, &bmp280_cfg);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);

    static uint8_t chip_id;
    /* Passing chip_id as user data to verify that the correct chip id was read out */
    rc = bmp280_get_chip_id(bmp280_inst, &chip_id, init_part_4_complete, (void *)&chip_id);
    EAS_ASSERT(rc == BMP280_RESULT_CODE_OK);
}

/**
 * @brief Callback to execute once part 3 of hw platform init is complete.
 *
 * This submits part 4 of hw platform init to the central event queue as a callback to execute.
 *
 * @param result_code Signifies whether BH1750 measurement time was set successfully.
 * @param user_data User data, unused in this callback.
 */
static void init_part_3_complete(uint8_t result_code, void *user_data)
{
    if (result_code == SHT3X_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_4, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

/**
 * @brief Hardware platform initialization part 3.
 *
 * @param user_data This parameter is only here so that the function signature complies with what can be submitted to
 * event queue as a callback. It is not used in the implementation.
 */
static void hw_platform_init_part_3(void *user_data)
{
    /* Lowest possible to capture the widest possible range of lx measurements */
    uint8_t meas_time = 31;
    uint8_t rc = bh1750_set_measurement_time(bh1750_inst, meas_time, init_part_3_complete, NULL);
    EAS_ASSERT(rc == BH1750_RESULT_CODE_OK);
}

/**
 * @brief Callback to execute once part 2 of hw platform init is complete.
 *
 * This submits part 3 of hw platform init to the central event queue as a callback to execute.
 *
 * @param result_code Signifies whether BH1750 initialization was successful.
 * @param user_data User data, unused in this callback.
 */
static void init_part_2_complete(uint8_t result_code, void *user_data)
{
    if (result_code == SHT3X_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_3, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

/**
 * @brief Hardware platform initialization part 2.
 *
 * @param user_data This parameter is only here so that the function signature complies with what can be submitted to
 * event queue as a callback. It is not used in the implementation.
 */
static void hw_platform_init_part_2(void *user_data)
{
    uint8_t rc;
    BH1750InitConfig bh1750_cfg = {
        .get_instance_memory = bh1750_driver_get_instance_memory,
        .get_instance_memory_user_data = NULL,
        .i2c_write = bh1750_driver_i2c_write,
        /* So that i2c_write pushes I2C operations to I2C queue */
        .i2c_write_user_data = (void *)&i2c_queue,
        .i2c_read = bh1750_driver_i2c_read,
        /* So that i2c_read pushes I2C operations to I2C queue */
        .i2c_read_user_data = (void *)&i2c_queue,
        .start_timer = bh1750_driver_timer_start,
        .start_timer_user_data = (void *)&bh1750_timer_data,
        .i2c_addr = BH1750_I2C_ADDR,
    };
    rc = bh1750_create(&bh1750_inst, &bh1750_cfg);
    EAS_ASSERT(rc == BH1750_RESULT_CODE_OK);

